I've updated my repro repository to include Terraform: it works.

Full output follow

```
proxmox_virtual_environment_vm.proxmox_vm: Refreshing state... [id=102]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the last "tofu apply" which may have affected this plan:

  # proxmox_virtual_environment_vm.proxmox_vm has been deleted
  - resource "proxmox_virtual_environment_vm" "proxmox_vm" {
        id                      = "102"
      - ipv4_addresses          = [] -> null
        name                    = "simple-vm-via-opentofu"
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # proxmox_virtual_environment_vm.proxmox_vm will be created
  + resource "proxmox_virtual_environment_vm" "proxmox_vm" {
      + acpi                    = true
      + bios                    = "seabios"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + migrate                 = false
      + name                    = "simple-vm-via-opentofu"
      + network_interface_names = (known after apply)
      + node_name               = "proxmox"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = true
      + tablet_device           = true
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = (known after apply)

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "proxmox"
          + retries   = 1
          + vm_id     = 667
        }

      + initialization {
          + datastore_id = "local-lvm"
          + upgrade      = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "dhcp"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ instance_ips = [] -> (known after apply)

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

proxmox_virtual_environment_vm.proxmox_vm: Creating...
proxmox_virtual_environment_vm.proxmox_vm: Still creating... [10s elapsed]
proxmox_virtual_environment_vm.proxmox_vm: Still creating... [20s elapsed]
proxmox_virtual_environment_vm.proxmox_vm: Creation complete after 21s [id=101]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

instance_ips = tolist([
  tolist([
    "127.0.0.1",
  ]),
  tolist([
    "10.1.15.238",
  ]),
])